app/Controllers/MutabaahController.php

SELECT `mutabaah_tahfidz`.*, `santri`.`nama_lengkap` as `nama_santri`, `users`.`nama_lengkap` as `nama_ustadz`
FROM `mutabaah_tahfidz`
JOIN `santri` ON `santri`.`id` = `mutabaah_tahfidz`.`santri_id`
LEFT JOIN `users` ON `users`.`id` = `mutabaah_tahfidz`.`ustadz_id`
ORDER BY `mutabaah_tahfidz`.`tanggal` DESC, `mutabaah_tahfidz`.`created_at` DESC
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $model = new MutabaahModel();

        $mutabaah = $model->select('mutabaah_tahfidz.*, santri.nama_lengkap as nama_santri, users.nama_lengkap as nama_ustadz')
                          ->join('santri', 'santri.id = mutabaah_tahfidz.santri_id')
                          ->join('users', 'users.id = mutabaah_tahfidz.ustadz_id', 'left')
                          ->orderBy('mutabaah_tahfidz.tanggal', 'DESC')
                          ->orderBy('mutabaah_tahfidz.created_at', 'DESC')
                          ->findAll();