app/Controllers/ProfileController.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

            $file->move(FCPATH . 'uploads/profile', $newName);

            // Hapus foto lama jika ada
            $oldUser = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

        // Update session nama_lengkap
        session()->set('nama_lengkap', $updateData['nama_lengkap']);

        $userModel->update($id, $updateData);
---
UPDATE `users` SET `nama_lengkap` = 'Ustadz Dhanu', `foto_profil` = '1784216379_a6625f58a09d2edd2924.jpeg'
WHERE `users`.`id` IN ('1')