app/Controllers/SantriController.php

SELECT COUNT(*) AS `numrows`
FROM `santri`
LEFT JOIN `pondokan` ON `pondokan`.`id` = `santri`.`pondokan_id`
LEFT JOIN `halaqoh` ON `halaqoh`.`id` = `santri`.`halaqoh_id`
SELECT `santri`.*, `pondokan`.`nama_kamar`, `halaqoh`.`nama_halaqoh`
FROM `santri`
LEFT JOIN `pondokan` ON `pondokan`.`id` = `santri`.`pondokan_id`
LEFT JOIN `halaqoh` ON `halaqoh`.`id` = `santri`.`halaqoh_id`
ORDER BY `santri`.`nama_lengkap` ASC
 LIMIT 10
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $model = new SantriModel();

        // Join tabel untuk mendapatkan nama kamar & halaqoh menggunakan Model instance
        $model->select('santri.*, pondokan.nama_kamar, halaqoh.nama_halaqoh')
              ->join('pondokan', 'pondokan.id = santri.pondokan_id', 'left')
              ->join('halaqoh', 'halaqoh.id = santri.halaqoh_id', 'left');

        $search = $this->request->getGet('search');
        if (!empty($search)) {
            $model->groupStart()
                  ->like('santri.nama_lengkap', $search)
                  ->orLike('santri.nis', $search)
                  ->groupEnd();
        }

        // Menggunakan paginate() alih-alih findAll() agar server tidak overload (Pilar 2)
        $santris = $model->orderBy('santri.nama_lengkap', 'ASC')->paginate(10, 'santri');