app/Libraries/ActivityLogger.php

    public static function log(string $action, string $description)
    {
        // 1. Sebagai backup & audit file tingkat server (Tercatat di logs/log-*.php)
        log_message('info', "[ACTIVITY] {$action} | {$description}");

        $logModel = new ActivityLogModel();
        $request  = \Config\Services::request();

        try {
            // 2. Mencoba menyimpan ke Tabel Database tersendiri
            $logModel->insert([
                'user_id'     => session()->get('id') ?? null,
                'ip_address'  => $request->getIPAddress(),
                'action'      => $action,
                'description' => $description,
                'created_at'  => date('Y-m-d H:i:s')
            ]);
---
INSERT INTO `activity_logs` (`user_id`, `ip_address`, `action`, `description`, `created_at`) VALUES ('1', '::1', 'UPDATE_PROFILE', 'Memperbarui data profil', '2026-07-16 15:39:39')